<a href="https://colab.research.google.com/github/Ivanbh214/EDA/blob/main/EDA.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [3]:
#Open the file in the github and copy the repository
url = 'https://raw.githubusercontent.com/Ivanbh214/EDA/main/avocado.csv'
df = pd.read_csv(url, sep=",", error_bad_lines=False)

In [4]:
print(df.head(5))

   Unnamed: 0        Date  AveragePrice  ...          type  year  region
0           0  2015-12-27          1.33  ...  conventional  2015  Albany
1           1  2015-12-20          1.35  ...  conventional  2015  Albany
2           2  2015-12-13          0.93  ...  conventional  2015  Albany
3           3  2015-12-06          1.08  ...  conventional  2015  Albany
4           4  2015-11-29          1.28  ...  conventional  2015  Albany

[5 rows x 14 columns]

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18249 entries, 0 to 18248
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    18249 non-null  int64
 1   Date          18249 non-null  object
 2   AveragePrice  18249 non-null  float64
 3   Total Volume  18249 non-null  float64
 4   4046          18249 non-null  float64
 5   4225          18249 non-null  float64
 6   4770          18249 non-null  float64
 7   Total Bags    18249 non-null  float64
 8   Small Bags    18249 non-null  float64
 9   Large Bags    18249 non-null  float64
 10  XLarge Bags   18249 non-null  float64
 11  type          18249 non-null  object
 12  year          18249 non-null  int64
 13  region        18249 non-null  object
dtypes: float64(9), int64(2), object(3)
memory usage: 1.9+ MB

In [7]:
df.shape

(18249, 14)

We can see that 3 columns no have name, have numbers. So, this is have to be fix

##Exploratory Data Analysis from avocado dataset
1- Transform any character in interget ato NA 

*   Select the same type of variables

*   Transform this character to NA


2- Count the number of NA

In [13]:
df.columns

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'],
      dtype='object')

In [15]:
df["4046"]

0        1036.74
1         674.28
2         794.70
3        1132.00
4         941.48
          ...
18244    2046.96
18245    1191.70
18246    1191.92
18247    1527.63
18248    2894.77
Name: 4046, Length: 18249, dtype: float64

In [16]:
df[["AveragePrice","Total Volume"]]

       AveragePrice  Total Volume
0              1.33      64236.62
1              1.35      54876.98
2              0.93     118220.22
3              1.08      78992.15
4              1.28      51039.60
...             ...           ...
18244          1.63      17074.83
18245          1.71      13888.04
18246          1.87      13766.76
18247          1.93      16205.22
18248          1.62      17489.58

[18249 rows x 2 columns]

In [8]:
df[df == NA].value_count()

NameError: ignored